public class hw {
}

//1. Нужно задать в конфигурационном файле для Mozilla папку для скачивания и
//   отключить блокировку всплывающих окон.
//   Настройте профиль Firefox Mozilla для работы с плагинами (например, КриптоПро ЭЦП Browser plug-in).
//   Выберите в браузере IE11 одинаковые настройки доменных зон и сделайте переход на сайт GeekBrains
//   для проверки.
//2. *Настройте запуск проекта через терминал, чтобы на вход передавались тип браузера (Firefox или IE),
//   название сайта (GeekBrains) и название теста, который мы будем запускать.
//   Соответственно, к названию сайта нужно привязать настройку headless из конфигурационного файла
//   (Chrome и Firefox будут запускаться в невидимом режиме).
//   Создайте два метода — test1 и test2, которые будут вызываться в зависимости от параметра.

